<template>
  <div>
    <div class="header"> 
      <h1>服务条款</h1>
    </div>
    <div class="body">  
      <div class="service_term">   
        <h4> &nbsp; &nbsp; &nbsp; 欢迎您来到星威矿池。请仔细阅读以下服务条款（以下简称为“本条款”）。通过点击“登录”按钮或通过访问或使用本服务，即视为您（即“用户”）同意遵守本条款及所有附加条款。
          如果您不同意受本条款的约束，请勿访问或使用本服务。我们保留随时更改或修改本条款中所含内容的权利，包括但不限于本网站的任何政策或准则。
          我们会将修改后的条款发布到本网站，并将“最后更新”日期列在本条款顶部，或通过电子邮件发送给用户提供的注册邮箱，或以我们确定的任何其他方式自行决定。
          任何更改会在发布网站更新后或声明更改后立即生效。更改将持续生效。您放弃接收有关此类更改的特定通知的权利。继续使用本网站表示您接受此类更改。如果您不同意本条款，请立即停止使用本网站。
          我们希望您经常回顾本条款，以确保您了解适用于您访问和使用本服务的条款和条件。本条款及附加条款适用于您访问和使用由我们提供的任何服务，包括但不限于网站https://www.xingjirw.com/（以下简称“网站服务”）
          以及我们提供的移动应用程序（“移动应用服务”，与网站服务合称为“本服务”）。
          签订其他有关我们所提供的产品的相关协议不会影响本条款的生效。如果您代表任何机构使用本服务，您声明并保证
          <br> &nbsp; &nbsp; &nbsp; (a)该机构是符合当地法律法规的合法机构，
          <br> &nbsp; &nbsp; &nbsp; (b)您有权代表该机构接受本条款。如果您违反本条款，该机构同意对您的行为负责。</h4>
        <h2>一、注册与帐户</h2>
        <h3>1. 注册者资格</h3>
        <h4> &nbsp; &nbsp; &nbsp; 您确认，在您完成注册程序或以其他我们允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。
          若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且我们有权注销或永久冻结您的帐户，并向您及您的监护人索偿。</h4>
        <h3>2. 注册和帐户</h3>   
        <h4> &nbsp; &nbsp; &nbsp; 在您按照注册页面提示填写信息、阅读并同意本条款且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本条款且完成全部激活程序后，
          或您以其他我们允许的方式实际使用本服务时，您即受本条款约束。您可以使用您提供或确认的邮箱、手机号码或者我们允许的其它方式作为登录手段进入矿池。
          如果您在注册时提供的信息不准确，我们对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。</h4> 
        <h3>3. 用户信息</h3>   
        <h4> &nbsp; &nbsp; &nbsp; 在完成注册或激活流程时，您应当依据法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时、完整和准确。
          如我们有合理理由怀疑您提供的资料错误、不实、过时或不完整的，我们有权向您发出询问或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止或终止对您提供部分或全部本服务。
          我们对此不承担任何责任，您将承担因此产生的任何直接和间接损失及不利后果。
          <br> &nbsp; &nbsp; &nbsp; 您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便我们或其他用户与您进行有效联系，如通过这些联系方式无法与您取得联系，
            导致您在使用本服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更或需要更新的，您应按我们的要求进行操作。</h4> 
        <h3>4. 帐户安全</h3>   
        <h4> &nbsp; &nbsp; &nbsp; 您须自行负责对您的登陆用户名和密码的保密，且须对您在该登录名和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务、设置帐户信息等）承担责任。
          <br> 您同意：
          <br> &nbsp; &nbsp; &nbsp; (a)如发现任何人未经授权使用您的矿池账号和密码，或发生违反保密规定的任何其他情况，您会立即通知我们；
          <br> &nbsp; &nbsp; &nbsp; (b)确保您严格遵守网站/服务的安全、认证、设置、操作机制或者流程；
          <br> &nbsp; &nbsp; &nbsp; (c) 确保您在每个上网时段结束时，以正确步骤离开网站/服务。我们不能也不会对因您未能遵守本款规定而发生的任何损失负责。
            您理解我们对您的请求采取行动需要合理时间，我们对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</h4> 
        <h2>二、服务内容</h2>
        <h4> &nbsp; &nbsp; &nbsp; 1.通过我们及我们的关联公司提供的矿池服务和其它服务，我们为客户提供数字货币矿池、数字货币挖矿、云挖矿合约、数字货币咨询等其他可能的新增的服务及产品。
          参加我们组织的活动以及使用其它信息服务及技术服务。
          <br> &nbsp; &nbsp; &nbsp; 2. 您了解并同意，我们有权应政府部门（包括司法及行政部门）的要求，向其提供您向我们提供的用户信息和操作支付记录等必要信息。
          如您涉嫌侵犯他人知识产权等合法权益，则我们亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。
            <br> &nbsp; &nbsp; &nbsp; 3. 您在使用本服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。</h4> 
        <h2>三、服务使用规范</h2>
        <h4> &nbsp;  &nbsp; &nbsp; 1.在矿池上使用本服务过程中，您承诺遵守以下约定：在使用本服务过程中实施的所有行为均遵守国家法律、法规等规范性文件及我们各项规则的规定和要求，
          不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本条款及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，
          并确保我们免于因此产生任何损失。不对矿池上的任何数据作商业性利用，包括但不限于在未经我们事先书面同意的情况下，以复制、传播等任何方式使用矿池站上展示的资料。
          不使用任何装置、软件或例行程序干预或试图干预矿池的正常运作。您不得采取任何将导致不合理的庞大数据负载加诸矿池网络设备的行动。
          <br> &nbsp;  &nbsp; &nbsp; 2.您了解并同意：我们有权对您是否违反上述承诺做出单方认定，并根据单方认定结果予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。
          经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者我们根据自身的判断，认为您的行为涉嫌违反本条款或涉嫌违反法律法规的规定的，则我们有权在矿池上公示您的该等涉嫌违法或违约行为及我们已对您采取的措施。
          对于您在矿池上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本条款或法律法规的信息，我们有权不经通知您即予以删除，且按照相关规定进行处罚。
          对于您在矿池上实施的行为，包括您未在矿池上实施但已经对矿池及其用户产生影响的行为，我们有权单方认定您行为的性质及是否构成对本协议的违反，并据此作出相应处罚。
          您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保我们免于因此产生损失或增加费用。
          如您涉嫌违反有关法律或者本条款之规定，使我们遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿我们因此造成的损失及（或）发生的费用，包括合理的律师费用。</h4>
        <h2>四、用户义务</h2>
        <h4> &nbsp; &nbsp; &nbsp; 1、用户不得利用本服务危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本服务制作、复制和传播下列信息：
          <br> &nbsp; &nbsp;（1）煽动抗拒、破坏宪法和法律、行政法规实施的；
          <br> &nbsp; &nbsp;（2）煽动颠覆国家政权，推翻社会主义制度的；
          <br> &nbsp; &nbsp;（3）煽动分裂国家、破坏国家统一的；
          <br> &nbsp; &nbsp;（4）煽动民族仇恨、民族歧视，破坏民族团结的；
          <br> &nbsp; &nbsp;（5）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；
          <br> &nbsp; &nbsp;（6）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；
          <br> &nbsp; &nbsp;（7）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；
          <br> &nbsp; &nbsp;（8）损害国家机关信誉的；
          <br> &nbsp; &nbsp;（9）其他违反宪法和法律行政法规的；
          <br> &nbsp; &nbsp;（10）进行商业广告行为的。
          <br> &nbsp; &nbsp; &nbsp; 2、用户不得通过任何手段恶意注册矿池网站帐号，包括但不限于以牟利、炒作、套现、获奖等为目的多个账号注册。用户亦不得盗用其他用户帐号。
          如用户违反上述规定，则我们有权直接采取一切必要的措施，包括但不限于删除用户发布的内容、暂停或查封用户帐号，取消因违规所获利益，乃至通过诉讼形式追究用户法律责任等。
          <br> &nbsp; &nbsp; &nbsp; 3、禁止用户将矿池以任何形式作为从事各种非法活动的场所、平台或媒介。
          未经我们的授权或许可，用户不得借用本站的名义从事任何商业活动，也不得以任何形式将矿池作为从事商业活动的场所、平台或媒介。</h4>
        <h2>五、服务的变更、中断、终止、限制、冻结</h2>
        <h4> &nbsp; &nbsp; &nbsp; 1、我们可能会对服务内容进行变更，也可能会中断、中止或终止服务。
          <br> &nbsp; &nbsp; &nbsp; 2、转让时，我们可向第三方转让本服务下相关资产；我们也可在单方通知您后，将本条款下部分或全部服务转交由第三方运营或履行。具体受让主体以我们通知的为准。
          <br> &nbsp; &nbsp; &nbsp; 3、如发生下列任何一种情形，我们有权不经通知而中断或终止向您提供的服务：
          <br> &nbsp; &nbsp;（1）根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
          <br> &nbsp; &nbsp;（2）您违反相关法律法规或本条款的约定；
          <br> &nbsp; &nbsp;（3）按照法律规定或主管部门的要求；
          <br> &nbsp; &nbsp;（4）出于安全的原因或其他必要的情形。
          <br> &nbsp; &nbsp; &nbsp; 4、您可以随时关闭您的帐户。您仍然有义务履行您对任何待处理交易的责任。此外，您将对关闭前发生的任何费用向我们负责。我们还可以通过电子邮件或其他方式通知您后，随时自行决定终止您的帐户。
          如果有嫌疑显示您未能遵守本条款、对我们构成不可接受的欺诈或管理风险，或者您提供给我们虚假，不完整，不准确或误导性的信息，我们可能会暂停您的访问服务。
          由于我们关闭或暂停您的帐户所造成的任何损失，我们将不承担任何责任。
          <br> &nbsp;  &nbsp;  &nbsp; 5、用户同意，为了用户的帐户及其内数字货币的安全，根据本条款的约定、法律法规及法律文书的规定、政府依行政职权的要求及我们依据自行判断认为的可能对用户的帐户产生风险的情况，
          我们有权对用户名下的全部或部分帐户进行冻结，即进行暂时关闭这些帐户部分或全部使用权限的操作。冻结的逆过程为解冻，即我们对被冻结的帐户结束冻结。当冻结发生时，如用户申请解冻，
          我们有权依照自行判断根据本项规定前述的冻结原因来决定是否允许全部或部分解冻，用户应充分理解解冻申请并不必然被允许，且申请解冻时用户应当配合我们核实用户的身份的有关要求，
          提供包括但不限于身份信息、身份证、护照、其他有效的身份证明文件及我们要求的其他信息或文件。</h4>
        <h2>六、隐私政策</h2>
        <h4> &nbsp; &nbsp; &nbsp; 我们尊重用户的隐私。我们的隐私政策单独提供，规定了我们将如何收集，存储，披露和使用与您的隐私相关的信息。您同意我们根据隐私政策的条款使用您的信息。
          <br> &nbsp; &nbsp; &nbsp; 本条款所称之矿池网用户信息是指符合法律、法规及相关规定，并符合下述范围的信息：
          <br> &nbsp; &nbsp;（1）用户注册矿池时，向矿池提供的个人信息；
          <br> &nbsp; &nbsp;（2）用户在使用矿池服务、参加网站活动或访问网站网页时，矿池自动接收并记录的用户浏览器端或手机客户端数据，包括但不限于IP地址、网站Cookie中的资料及用户要求取用的网页记录；
          <br> &nbsp; &nbsp;（3）我们从商业伙伴处合法获取的用户个人信息；
          <br> &nbsp; &nbsp;（4）其它我们通过合法途径获取的用户个人信息。
          <br> 我们承诺：
          <br> &nbsp; &nbsp; &nbsp; 非经法定原因或用户事先许可，我们不会向任何第三方透露用户的密码、姓名、手机号码等非公开信息；
          <br> 在下述法定情况下，用户的个人信息将会被部分或全部披露：
          <br> &nbsp; &nbsp;（1）经用户同意向用户本人或其他第三方披露；
          <br> &nbsp; &nbsp;（2）根据法律、法规等相关规定，或行政机构要求，向行政、司法机构或其他法律规定的第三方披露；
          <br> &nbsp; &nbsp;（3）其它我们根据法律、法规等相关规定进行的披露。</h4>
        <h2>七、法律适用、管辖与其他</h2>
        <h4> &nbsp; &nbsp; &nbsp; 1、本条款之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。
          <br> &nbsp; &nbsp; &nbsp; 2、本条款包含了您使用矿池需遵守的一般性规范，您在通过登录其他平台使用矿池时还需遵守适用于该平台的特殊性规范（具体请参见您与该平台签署的其他协议以及平台规则等内容）。
          一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。
          &nbsp; &nbsp; &nbsp; 3、因本条款产生之争议，应首先通过友好协商解决，协商不成的，一方应将争议提交至四川省成都市人民法院诉讼解决。</h4>
      </div>
    </div>
    <div class="footer_st">
      <h5>本协议于2019年12月23日首次发布，生效时间为Filecoin主网正式上线起。</h5>
    </div>
  </div>
</template>

<script>
export default {
  name: 'ServiceTerm',
  data() {
    return {}
  }
}
</script>

<style lang="scss" scope>
  .header {
    position: absolute;
    height: 3rem;
    top: 2rem;
    left: 0.5rem;
    right: 0.5rem;
    h1 {
      color: #003366;
      text-align: center;
      font-size: 18px;
      font-weight: 550;
    }     
  }
  .body {
    position: absolute;
    top: 5rem;
    bottom: 3rem;
    left: 0.5rem;
    right: 0.5rem;
    overflow: auto;
    .service_term {
      padding: 0.5rem 0.5rem 0.5rem 0.5rem;
      text-align: left;
      h2 {
        font-size: 16px; 
        font-weight: 550;
        margin-top: 0.5rem;
        margin-bottom: 0.5rem;
      }
      h3 {
        color: #003366;
        font-size: 14px; 
        font-weight: 550;  
        margin-top: 0.4rem;
        margin-bottom: 0.5rem;
      }
      h4 {
        color: #000;
        font-weight: 400;
        font-size: 13px; 
      }
    }       
  }
  .body::-webkit-scrollbar {/*滚动条整体样式*/
    width: 5px;     /*高宽分别对应横竖滚动条的尺寸*/
    height: 1px;
  }
  .body::-webkit-scrollbar-thumb {/*滚动条里面小方块*/
    border-radius: 4px;
    background-color: #4bb0ff;
    background-image: -webkit-linear-gradient(45deg, rgba(255, 255, 255, .2) 25%, 
    transparent 25%, transparent 50%, rgba(255, 255, 255, .2) 50%, rgba(255, 255, 255, .2) 75%, transparent 75%, transparent);
  }
  .body::-webkit-scrollbar-track {/*滚动条里面轨道*/
    -webkit-box-shadow: inset 0 0 6px rgba(0,0,0,0.2);
    background: #EDEDED;
  }
  .footer_st {
    position: absolute;
    height: 2.5rem;
    bottom: 0.5rem; 
    left: 0.5rem;
    right: 0.5rem;
    text-align: center;
    h5 {
      color: #999;
      font-size: 8px;
      margin-top: 1rem;
    }
  }
</style>